# Ultralytics YOLO 🚀, AGPL-3.0 license
# Catman Jr., Dec. 29, 2024
# YOLO11-Earth object detection model with P3-P5 outputs. For details on its base model YOLOv8-Worldv2 see https://docs.ultralytics.com/tasks/detect

# Parameters (on xView)
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11s-earth.yaml' will call yolo11-earth.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # no data
  s: [0.50, 0.50, 1024] # summary: 336 layers, 15,188,840 parameters, 15,188,824 gradients, 50.2 GFLOPs
  m: [0.50, 1.00, 512] # summary: 372 layers, 33,177,778 parameters, 33,177,762 gradients, 137.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 522 layers, 39,922,610 parameters, 39,922,594 gradients, 161.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 522 layers, 89,123,872 parameters, 89,123,856 gradients, 345.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2fAttn, [512, 256, 8]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2fAttn, [256, 128, 4]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fAttn, [512, 256, 8]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fAttn, [1024, 512, 16]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, WorldDetect, [nc, 512, True]] # Detect(P3, P4, P5)
